Repository: MinaNady97/MetroAppFlutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# locale
source: en
ar: ar

# appTitle
source: Home Page
ar: الصفحة الرئيسية

# departureStationTitle
source: Departure Station
ar: محطة المغادرة

# arrivalStationTitle
source: Arrival Station
ar: محطة الوصول

# departureStationHint
source: Select the departure station
ar: اختر محطة المغادرة

# arrivalStationHint
source: Select the arrival station
ar: اختر محطة الوصول

# destinationFieldLabel
source: Enter your destination
ar: أدخل وجهتك

# findButtonText
source: Find
ar: ابحث

# showRoutesButtonText
source: Show Routes
ar: عرض الطرق

# pleaseSelectDeparture
source: Please select departure station.
ar: يرجى اختيار محطة المغادرة.

# pleaseSelectArrival
source: Please select arrival station.
ar: يرجى اختيار محطة الوصول.

# selectDifferentStations
source: Please select different stations.
ar: يرجى اختيار محطات مختلفة.

# nearestStationLabel
source: Nearest Station
ar: أقرب محطة

# addressNotFound
source: Address not found. Please try with more details.
ar: لم يتم العثور على العنوان. يرجى المحاولة بمزيد من التفاصيل.

source: No routes found
ar: لا توجد طرق

source: Invalid data format
ar: تنسيق البيانات غير صالح

source: Route to Nearest
ar: الطريق لأقرب محطة

source: Route to Destination
ar: الطريق للوجهة

# pleaseClickOnMyLocation
source: Please click on my location button first
ar: يرجى النقر على زر موقعي أولاً

# mustTypeADestination
source: Must type a destination first.
ar: يجب كتابة وجهة أولاً.

source: Estimated travel time
ar: الوقت المقدر للسفر

source: Ticket Price
ar: سعر التذكرة

source: No. of stations
ar: عدد المحطات

# changeAt
source: You will change at
ar: سوف تتغير في

# totalTravelTime
source: Estimated total travel time
ar: الوقت المقدر الإجمالي للسفر

# changeTime
source: Estimated travel time for changing lines
ar: الوقت المقدر للتغيير بين الخطوط

source: First take
ar: الخط الأول

source: First Direction
ar: الاتجاه الأول

source: First Departure
ar: المغادرة الأولى

source: First Arrival
ar: الوصول الأول

source: First Intermediate Stations
ar: المحطات الوسيطة الأولى

source: Second take
ar: الخط الثاني

source: Second Direction
ar: الاتجاه الثاني

source: Second Departure
ar: المغادرة الثانية

source: Second Arrival
ar: الوصول الثاني

source: Second Intermediate Stations
ar: المحطات الوسيطة الثانية

source: Third take
ar: الخط الثالث

source: Third Direction
ar: الاتجاه الثالث

source: Third Departure
ar: المغادرة الثالثة

source: Third Arrival
ar: الوصول الثالث

source: Third Intermediate Stations
ar: المحطات الوسيطة الثالثة

source: Error:
ar: خطأ:

# mustTypeDestination
source: Must type a destination first.
ar: يجب كتابة وجهة اولا.ً

source: Route Details
ar: تفاصيل الرحلة

source: Departure:
ar: المغادرة:

source: Arrival:
ar: الوصول:

source: Take:
ar: ركوب:

source: Direction:
ar: الاتجاه:

source: Intermediate Stations:
ar: المحطات الوسيطة:

# egp
source: {price} EGP
ar: {price} جنيه

source: Show Stations
ar: عرض المحطات

source: Hide Stations
ar: إخفاء المحطات

source: Show Route
ar: عرض المسار

# metro1
source: Metro Line 1
ar: الخط الأول

# metro2
source: Metro Line 2
ar: الخط الثاني

# metro3branch1
source: Metro Line 3 Branch ROD EL FARAG AXIS
ar: الخط الثالث تفريعة محور روض الفرج

# metro3branch2
source: Metro Line 3 Branch CAIRO UNIVERSITY
ar: الخط الثالث تفريعة جامعة القاهرة

# distanceToStation
source: The distance to {stationName} is {distance} meters
ar: المسافة إلى {stationName} هي {distance} مترًا

# reachedStation
source: You have reached {stationName}
ar: لقد وصلت إلى {stationName}

# nextStation
source: Current station is {currentStationName} and next station is {nextStationName}
ar: المحطة الحالية هي {currentStationName} والمحطة التالية هي {nextStationName}

# changeLineAt
source: Current station is {currentStationName} and next station is {nextStationName} you will change to {lineName} direction {direction}
ar: المحطة الحالية هي {currentStationName} والمحطة التالية هي {nextStationName} ستغير إلى {lineName} اتجاه {direction}

# finalStation
source: Current station is {currentStationName} and next station is {nextStationName} it is your arrival station
ar: المحطة الحالية هي {currentStationName} والمحطة التالية هي {nextStationName} وهي محطتك النهائية

# finalStationReached
source: Reached arrival station, trip completed
ar: تم الوصول إلى محطة الوصول، الرحلة اكتملت

source: Exchange Station
ar: محطة تبادلية

# intermediateStationsTitle
source: Intermediate Stations
ar: المحطات الوسيطة

# metroStationHELWAN
source: HELWAN
ar: حلوان

# metroStationAIN_HELWAN
source: AIN HELWAN
ar: عين حلوان

# metroStationHELWAN_UNIVERSITY
source: HELWAN UNIVERSITY
ar: جامعة حلوان

# metroStationWADI_HOF
source: WADI HOF
ar: وادي حوف

# metroStationHADAYEK_HELWAN
source: HADAYEK HELWAN
ar: حدائق حلوان

# metroStationEL_MAASARA
source: EL-MAASARA
ar: المعصرة

# metroStationTORA_EL_ASMANT
source: TORA EL-ASMANT
ar: طرة الأسمنت

# metroStationKOZZIKA
source: KOZZIKA
ar: كوتسيكا

# metroStationTORA_EL_BALAD
source: TORA EL-BALAD
ar: طرة البلد

# metroStationTHAKANAT_EL_MAADI
source: THAKANAT EL-MAADI
ar: ثكنات المعادي

# metroStationMAADI
source: MAADI
ar: المعادي

# metroStationHADAYEK_EL_MAADI
source: HADAYEK EL-MAADI
ar: حدائق المعادي

# metroStationDAR_EL_SALAM
source: DAR EL-SALAM
ar: دار السلام

# metroStationEL_ZAHRAA
source: EL-ZAHRAA
ar: الزهراء

# metroStationMAR_GIRGIS
source: MAR GIRGIS
ar: مار جرجس

# metroStationEL_MALEK_EL_SALEH
source: EL-MALEK EL-SALEH
ar: الملك الصالح

# metroStationSAYEDA_ZEINAB
source: SAYEDA ZEINAB
ar: السيدة زينب

# metroStationSAAD_ZAGHLOUL
source: SAAD ZAGHLOUL
ar: سعد زغلول

# metroStationSADAT
source: SADAT
ar: السادات

# metroStationGAMAL_ABD_EL_NASSER
source: GAMAL ABD EL-NASSER
ar: جمال عبد الناصر

# metroStationORABI
source: ORABI
ar: عرابي

# metroStationEL_SHOHADAAH
source: EL-SHOHADAAH
ar: الشهداء

# metroStationGHAMRA
source: GHAMRA
ar: غمرة

# metroStationEL_DEMERDASH
source: EL-DEMERDASH
ar: الدمرداش

# metroStationMANSHIET_EL_SADR
source: MANSHIET EL-SADR
ar: منشية الصدر

# metroStationKOBRI_EL_QOBBA
source: KOBRI EL-QOBBA
ar: كوبري القبة

# metroStationHAMMAMAT_EL_QOBBA
source: HAMMAMAT EL-QOBBA
ar: حمامات القبة

# metroStationSARAY_EL_QOBBA
source: SARAY EL-QOBBA
ar: سراي القبة

# metroStationHADAYEK_EL_ZAITOUN
source: HADAYEK EL-ZAITOUN
ar: حدائق الزيتون

# metroStationHELMEYET_EL_ZAITOUN
source: HELMEYET EL-ZAITOUN
ar: حلمية الزيتون

# metroStationEL_MATARYA
source: EL-MATARYA
ar: المطرية

# metroStationAIN_SHAMS
source: AIN SHAMS
ar: عين شمس

# metroStationEZBET_EL_NAKHL
source: EZBET EL-NAKHL
ar: عزبة النخل

# metroStationEL_MARG
source: EL-MARG
ar: المرج

# metroStationNEW_EL_MARG
source: NEW EL-MARG
ar: المرج الجديدة

# metroStationEL_MOUNIB
source: EL-MOUNIB
ar: المنيب

# metroStationSAQYET_MAKKI
source: SAQYET MAKKI
ar: ساقية مكي

# metroStationOM_EL_MASRYEEN
source: OM EL-MASRYEEN
ar: أم المصريين

# metroStationGIZA
source: GIZA
ar: جيزة

# metroStationFEISAL
source: FEISAL
ar: فيصل

# metroStationCAIRO_UNIVERSITY
source: CAIRO UNIVERSITY
ar: جامعة القاهرة

# metroStationEL_BEHOUS
source: EL-BEHOUS
ar: البحوث

# metroStationEL_DOKKI
source: EL-DOKKI
ar: الدقي

# metroStationOPERA
source: OPERA
ar: الأوبرا

# metroStationMOHAMED_NAGUIB
source: MOHAMED NAGUIB
ar: محمد نجيب

# metroStationATABA
source: ATABA
ar: عتبة

# metroStationMASARA
source: MASARA
ar: مسرة

# metroStationROUD_EL_FARAG
source: ROUD EL-FARAG
ar: رود الفرج

# metroStationSAINT_TERESA
source: SAINT TERESA
ar: سانت تيريزا

# metroStationKHALAFAWEY
source: KHALAFAWEY
ar: خلفاوي

# metroStationMEZALLAT
source: MEZALLAT
ar: مزلات

# metroStationKOLLEYET_EL_ZERA3A
source: KOLLEYET EL-ZERA3A
ar: كلية الزراعة

# metroStationSHOUBRA_EL_KHEIMA
source: SHOUBRA EL-KHEIMA
ar: شبرا الخيمة

# metroStationADLY_MANSOUR
source: ADLY MANSOUR
ar: عدلي منصور

# metroStationEL_HAYKSTEP
source: EL-HAYKSTEP
ar: الهايكستب

# metroStationOMAR_IBN_EL_KHATTAB
source: OMAR IBN EL-KHATTAB
ar: عمر بن الخطاب

# metroStationQOBA
source: QOBA
ar: قوبا

# metroStationHESHAM_BARAKAT
source: HESHAM BARAKAT
ar: هشام بركات

# metroStationEL_NOZHA
source: EL-NOZHA
ar: النزهة

# metroStationNADI_EL_SHAMS
source: NADI EL-SHAMS
ar: نادي الشمس

# metroStationALF_MASKAN
source: ALF MASKAN
ar: ألف مسكن

# metroStationHELIOPOLIS
source: HELIOPOLIS
ar: هيليوبوليس

# metroStationHAROUN
source: HAROUN
ar: هارون

# metroStationEL_AHRAM
source: EL-AHRAM
ar: الأهرام

# metroStationKOLLEYET_EL_BANAT
source: KOLLEYET EL-BANAT
ar: كلية البنات

# metroStationEL_ESTAD
source: EL-ESTAD
ar: الاستاد

# metroStationARD_EL_MAARD
source: ARD EL-MAARD
ar: أرض المعارض

# metroStationABASIA
source: ABASIA
ar: عباسية

# metroStationABDO_BASHA
source: ABDO BASHA
ar: عبد باشا

# metroStationEL_GEISH
source: EL-GEISH
ar: الجيش

# metroStationBAB_EL_SHARIA
source: BAB EL-SHARIA
ar: باب الشريعة

# metroStationMASPERO
source: MASPERO
ar: ماسبيرو

# metroStationSAFAA_HEGAZI
source: SAFAA HEGAZI
ar: صفاء هجازي

# metroStationKIT_KAT
source: KIT KAT
ar: كتكات

# metroStationSUDAN
source: SUDAN
ar: السودان

# metroStationIMBABA
source: IMBABA
ar: إمبابة

# metroStationEL_BOHY
source: EL-BOHY
ar: البوهي

# metroStationEL_QAWMEYA
source: EL-QAWMEYA
ar: القومية

# metroStationEL_TARIQ_EL_DAIRY
source: EL-TARIQ EL-DAIRY
ar: الطريق الدائري

# metroStationROD_EL_FARAG_AXIS
source: ROD EL-FARAG AXIS
ar: محور روض الفرج

# metroStationEL_TOUFIQIA
source: EL-TOUFIQIA
ar: التوفيقية

# metroStationWADI_EL_NIL
source: WADI EL-NIL
ar: وادي النيل

# metroStationGAMAET_EL_DOWL_EL_ARABIA
source: GAMAET EL-DOWL EL-ARABIA
ar: جامعة الدول العربية

# metroStationBOLAK_EL_DAKROUR
source: BOLAK EL-DAKROUR
ar: بولاق الدكرور
